CSI API ETABS v1
cCombo.AddDesignDefaultCombos Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddDesignDefaultCombos(
	bool DesignSteel,
	bool DesignConcrete,
	bool DesignAluminum,
	bool DesignColdFormed
)
Function AddDesignDefaultCombos (
	DesignSteel As Boolean,
	DesignConcrete As Boolean,
	DesignAluminum As Boolean,
	DesignColdFormed As Boolean
) As Integer
Dim instance As cCombo
Dim DesignSteel As Boolean
Dim DesignConcrete As Boolean
Dim DesignAluminum As Boolean
Dim DesignColdFormed As Boolean
Dim returnValue As Integer
returnValue = instance.AddDesignDefaultCombos(DesignSteel,
	DesignConcrete, DesignAluminum,
	DesignColdFormed)
int AddDesignDefaultCombos(
	bool DesignSteel,
	bool DesignConcrete,
	bool DesignAluminum,
	bool DesignColdFormed
)
abstract AddDesignDefaultCombos :
        DesignSteel : bool *
        DesignConcrete : bool *
        DesignAluminum : bool *
        DesignColdFormed : bool -> int
Parameters
DesignSteel
Type: System.Boolean
DesignConcrete
Type: System.Boolean
DesignAluminum
Type: System.Boolean
DesignColdFormed
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCombo Interface
ETABSv1 Namespace